MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAL176/mcu.h
extern volatile __C2FIFOCON27bits_t C2FIFOCON27bits __asm__ ("C2FIFOCON27") __attribute__((section("sfrs"), address(0xBF881A10)));
extern volatile uint32_t        C2FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF881A14)));
extern volatile uint32_t        C2FIFOCON27SET __attribute__((section("sfrs"),address(0xBF881A18)));
extern volatile uint32_t        C2FIFOCON27INV __attribute__((section("sfrs"),address(0xBF881A1C)));
#define C2FIFOINT27 C2FIFOINT27
extern volatile uint32_t   C2FIFOINT27 __attribute__((section("sfrs"), address(0xBF881A20)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT27bits_t;
extern volatile __C2FIFOINT27bits_t C2FIFOINT27bits __asm__ ("C2FIFOINT27") __attribute__((section("sfrs"), address(0xBF881A20)));
extern volatile uint32_t        C2FIFOINT27CLR __attribute__((section("sfrs"),address(0xBF881A24)));
extern volatile uint32_t        C2FIFOINT27SET __attribute__((section("sfrs"),address(0xBF881A28)));
extern volatile uint32_t        C2FIFOINT27INV __attribute__((section("sfrs"),address(0xBF881A2C)));
#define C2FIFOUA27 C2FIFOUA27
extern volatile uint32_t   C2FIFOUA27 __attribute__((section("sfrs"), address(0xBF881A30)));
extern volatile uint32_t        C2FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF881A34)));
extern volatile uint32_t        C2FIFOUA27SET __attribute__((section("sfrs"),address(0xBF881A38)));
extern volatile uint32_t        C2FIFOUA27INV __attribute__((section("sfrs"),address(0xBF881A3C)));
#define C2FIFOCI27 C2FIFOCI27
extern volatile uint32_t   C2FIFOCI27 __attribute__((section("sfrs"), address(0xBF881A40)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI27bits_t;
extern volatile __C2FIFOCI27bits_t C2FIFOCI27bits __asm__ ("C2FIFOCI27") __attribute__((section("sfrs"), address(0xBF881A40)));
extern volatile uint32_t        C2FIFOCI27CLR __attribute__((section("sfrs"),address(0xBF881A44)));
extern volatile uint32_t        C2FIFOCI27SET __attribute__((section("sfrs"),address(0xBF881A48)));
extern volatile uint32_t        C2FIFOCI27INV __attribute__((section("sfrs"),address(0xBF881A4C)));
#define C2FIFOCON28 C2FIFOCON28
extern volatile uint32_t   C2FIFOCON28 __attribute__((section("sfrs"), address(0xBF881A50)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON28bits_t;
extern volatile __C2FIFOCON28bits_t C2FIFOCON28bits __asm__ ("C2FIFOCON28") __attribute__((section("sfrs"), address(0xBF881A50)));
extern volatile uint32_t        C2FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF881A54)));
extern volatile uint32_t        C2FIFOCON28SET __attribute__((section("sfrs"),address(0xBF881A58)));
extern volatile uint32_t        C2FIFOCON28INV __attribute__((section("sfrs"),address(0xBF881A5C)));
#define C2FIFOINT28 C2FIFOINT28
extern volatile uint32_t   C2FIFOINT28 __attribute__((section("sfrs"), address(0xBF881A60)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT28bits_t;
extern volatile __C2FIFOINT28bits_t C2FIFOINT28bits __asm__ ("C2FIFOINT28") __attribute__((section("sfrs"), address(0xBF881A60)));
extern volatile uint32_t        C2FIFOINT28CLR __attribute__((section("sfrs"),address(0xBF881A64)));
extern volatile uint32_t        C2FIFOINT28SET __attribute__((section("sfrs"),address(0xBF881A68)));
extern volatile uint32_t        C2FIFOINT28INV __attribute__((section("sfrs"),address(0xBF881A6C)));
#define C2FIFOUA28 C2FIFOUA28
extern volatile uint32_t   C2FIFOUA28 __attribute__((section("sfrs"), address(0xBF881A70)));
extern volatile uint32_t        C2FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF881A74)));
extern volatile uint32_t        C2FIFOUA28SET __attribute__((section("sfrs"),address(0xBF881A78)));
extern volatile uint32_t        C2FIFOUA28INV __attribute__((section("sfrs"),address(0xBF881A7C)));
#define C2FIFOCI28 C2FIFOCI28
extern volatile uint32_t   C2FIFOCI28 __attribute__((section("sfrs"), address(0xBF881A80)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI28bits_t;
extern volatile __C2FIFOCI28bits_t C2FIFOCI28bits __asm__ ("C2FIFOCI28") __attribute__((section("sfrs"), address(0xBF881A80)));
extern volatile uint32_t        C2FIFOCI28CLR __attribute__((section("sfrs"),address(0xBF881A84)));
extern volatile uint32_t        C2FIFOCI28SET __attribute__((section("sfrs"),address(0xBF881A88)));
extern volatile uint32_t        C2FIFOCI28INV __attribute__((section("sfrs"),address(0xBF881A8C)));
#define C2FIFOCON29 C2FIFOCON29
extern volatile uint32_t   C2FIFOCON29 __attribute__((section("sfrs"), address(0xBF881A90)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON29bits_t;
extern volatile __C2FIFOCON29bits_t C2FIFOCON29bits __asm__ ("C2FIFOCON29") __attribute__((section("sfrs"), address(0xBF881A90)));
extern volatile uint32_t        C2FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF881A94)));
extern volatile uint32_t        C2FIFOCON29SET __attribute__((section("sfrs"),address(0xBF881A98)));
extern volatile uint32_t        C2FIFOCON29INV __attribute__((section("sfrs"),address(0xBF881A9C)));
#define C2FIFOINT29 C2FIFOINT29
extern volatile uint32_t   C2FIFOINT29 __attribute__((section("sfrs"), address(0xBF881AA0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT29bits_t;
extern volatile __C2FIFOINT29bits_t C2FIFOINT29bits __asm__ ("C2FIFOINT29") __attribute__((section("sfrs"), address(0xBF881AA0)));
extern volatile uint32_t        C2FIFOINT29CLR __attribute__((section("sfrs"),address(0xBF881AA4)));
extern volatile uint32_t        C2FIFOINT29SET __attribute__((section("sfrs"),address(0xBF881AA8)));
extern volatile uint32_t        C2FIFOINT29INV __attribute__((section("sfrs"),address(0xBF881AAC)));
#define C2FIFOUA29 C2FIFOUA29
extern volatile uint32_t   C2FIFOUA29 __attribute__((section("sfrs"), address(0xBF881AB0)));
extern volatile uint32_t        C2FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF881AB4)));
extern volatile uint32_t        C2FIFOUA29SET __attribute__((section("sfrs"),address(0xBF881AB8)));
extern volatile uint32_t        C2FIFOUA29INV __attribute__((section("sfrs"),address(0xBF881ABC)));
#define C2FIFOCI29 C2FIFOCI29
extern volatile uint32_t   C2FIFOCI29 __attribute__((section("sfrs"), address(0xBF881AC0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI29bits_t;
extern volatile __C2FIFOCI29bits_t C2FIFOCI29bits __asm__ ("C2FIFOCI29") __attribute__((section("sfrs"), address(0xBF881AC0)));
extern volatile uint32_t        C2FIFOCI29CLR __attribute__((section("sfrs"),address(0xBF881AC4)));
extern volatile uint32_t        C2FIFOCI29SET __attribute__((section("sfrs"),address(0xBF881AC8)));
extern volatile uint32_t        C2FIFOCI29INV __attribute__((section("sfrs"),address(0xBF881ACC)));
#define C2FIFOCON30 C2FIFOCON30
extern volatile uint32_t   C2FIFOCON30 __attribute__((section("sfrs"), address(0xBF881AD0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON30bits_t;
